hey.log

Summary:
  Total:	1.0265 secs
  Slowest:	0.0818 secs
  Fastest:	0.0155 secs
  Average:	0.0406 secs
  Requests/sec:	249.3993
  
  Total data:	40192 bytes
  Size/request:	157 bytes

Response time histogram:
  0.015 [1]	|■
  0.022 [63]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [34]	|■■■■■■■■■■■■■■■■■■■■■■
  0.035 [11]	|■■■■■■■
  0.042 [28]	|■■■■■■■■■■■■■■■■■■
  0.049 [26]	|■■■■■■■■■■■■■■■■■
  0.055 [27]	|■■■■■■■■■■■■■■■■■
  0.062 [29]	|■■■■■■■■■■■■■■■■■■
  0.069 [15]	|■■■■■■■■■■
  0.075 [6]	|■■■■
  0.082 [16]	|■■■■■■■■■■


Latency distribution:
  10% in 0.0183 secs
  25% in 0.0222 secs
  50% in 0.0409 secs
  75% in 0.0557 secs
  90% in 0.0665 secs
  95% in 0.0789 secs
  99% in 0.0816 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0000 secs, 0.0059 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0043 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0014 secs
  resp wait:	0.0396 secs, 0.0154 secs, 0.0817 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0004 secs

Status code distribution:
  [400]	2 responses
  [405]	254 responses