hey.log

Summary:
  Total:	1.1527 secs
  Slowest:	0.3591 secs
  Fastest:	0.0203 secs
  Average:	0.1025 secs
  Requests/sec:	208.2153
  
  Total data:	32656 bytes
  Size/request:	157 bytes

Response time histogram:
  0.020 [1]	|■
  0.054 [74]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [43]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.122 [26]	|■■■■■■■■■■■■■■
  0.156 [35]	|■■■■■■■■■■■■■■■■■■■
  0.190 [4]	|■■
  0.224 [5]	|■■■
  0.257 [4]	|■■
  0.291 [0]	|
  0.325 [8]	|■■■■
  0.359 [8]	|■■■■


Latency distribution:
  10% in 0.0351 secs
  25% in 0.0421 secs
  50% in 0.0671 secs
  75% in 0.1422 secs
  90% in 0.2245 secs
  95% in 0.3181 secs
  99% in 0.3545 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0019 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0014 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.1023 secs, 0.0203 secs, 0.3587 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [400]	9 responses
  [405]	199 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused