hey.log

Summary:
  Total:	1.1436 secs
  Slowest:	0.3278 secs
  Fastest:	0.0201 secs
  Average:	0.1090 secs
  Requests/sec:	208.9829
  
  Total data:	32499 bytes
  Size/request:	157 bytes

Response time histogram:
  0.020 [1]	|■
  0.051 [52]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.082 [41]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.112 [29]	|■■■■■■■■■■■■■■■■■■■■■■
  0.143 [48]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.174 [3]	|■■
  0.205 [4]	|■■■
  0.235 [5]	|■■■■
  0.266 [10]	|■■■■■■■■
  0.297 [8]	|■■■■■■
  0.328 [6]	|■■■■■


Latency distribution:
  10% in 0.0324 secs
  25% in 0.0497 secs
  50% in 0.0939 secs
  75% in 0.1357 secs
  90% in 0.2463 secs
  95% in 0.2803 secs
  99% in 0.3184 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0010 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0008 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.1088 secs, 0.0201 secs, 0.3271 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [400]	11 responses
  [405]	196 responses

Error distribution:
  [32]	Put "http://ats": dial tcp 172.18.0.3:80: connect: connection refused